In [1]:
import sqlite3
import pandas as pd

In [3]:
conex = sqlite3.connect("./data/sql-murder-mystery.db")
cursor= conex.cursor()

# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):
    cursor.execute(query) 
    # Almacena los datos de la query 
    ans = cursor.fetchall()
    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in cursor.description]
    return pd.DataFrame(ans,columns=names)

In [ ]:
# 1. Primero vemos las tablas del modelo
query = '''
SELECT name 
FROM sqlite_master
where type = 'table'
'''

sql_query(query)

                     name
0      crime_scene_report
1         drivers_license
2                  person
3  facebook_event_checkin
4               interview
5      get_fit_now_member
6    get_fit_now_check_in
7                  income
8                solution

In [6]:
# 2. Ahora vemos la estructura de la tabla "crime_scena_report"
query = '''
SELECT sql 
FROM sqlite_master
where name = 'crime_scene_report'
'''

sql_query(query)

                                                 sql
0  CREATE TABLE crime_scene_report (\n        dat...

In [7]:
# 3. Ahora me centro en la fecha, ciudad indicada.
query = '''
SELECT *
FROM crime_scene_report
WHERE date = 20180115 AND city = 'SQL City'
'''

sql_query(query)

,date,type,description,city
0,20180115,assault,"Hamilton: Lee, do you yield? Burr: You shot hi...",SQL City
1,20180115,assault,Report Not Found,SQL City
2,20180115,murder,Security footage shows that there were 2 witne...,SQL City

In [9]:
# 4. Como veo que la columna type hay un "murder", me centro en esa información
query = '''
SELECT *
FROM crime_scene_report
WHERE type= "murder" AND date = 20180115 AND city = 'SQL City'
'''

sql_query(query)

,date,type,description,city
0,20180115,murder,Security footage shows that there were 2 witne...,SQL City

In [ ]:
# 5. Voy a ver si puedo ver la columna "description" completa
query = '''
SELECT description
FROM crime_scene_report
WHERE type= "murder" AND date = 20180115 AND city = 'SQL City'
'''

sql_query(query)

                                         description
0  Security footage shows that there were 2 witne...

In [ ]:
# al ejecutarlo en la web puedo ver el texto completo:

# Security footage shows that there were 2 witnesses. 
# The first witness lives at the last house on "Northwestern Dr". 
# The second witness, named Annabel, lives somewhere on "Franklin Ave".

In [27]:
# 6. El texto dice que había dos testigos. 
# Vamos a investigar al testigo 1: Me da la dirección, y según el modelo de datos
# puedo ver la dirección en la tabla "person" columna "address_street_name"
# además lo ordeno para quedarme con el número más alto de la casa
query = '''
SELECT *
FROM person
WHERE address_street_name = 'Northwestern Dr'
ORDER BY address_number DESC
'''

df1 = sql_query(query)
df1

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949
1,17729,Lasonya Wildey,439686,3824,Northwestern Dr,917817122
2,53890,Sophie Tiberio,957671,3755,Northwestern Dr,442830147
3,73368,Torie Thalmann,773862,3697,Northwestern Dr,341559436
4,96595,Coretta Cubie,303645,3631,Northwestern Dr,378403829
5,19420,Cody Schiel,890431,3524,Northwestern Dr,947110049
6,93509,Emmitt Aceuedo,916706,3491,Northwestern Dr,979073160
7,87456,Leonora Wolfsberger,215868,3483,Northwestern Dr,565203106
8,36378,Freddie Ellzey,267882,3449,Northwestern Dr,474117596
9,53076,Boris Bijou,664914,3327,Northwestern Dr,401191868
10,28360,Rashad Cascone,924517,3212,Northwestern Dr,838907424
11,23044,Val Portlock,924989,3143,Northwestern Dr,100593316
12,51114,Christena Saffell,814284,3055,Northwestern Dr,247657547
13,68690,Yer Modest,852404,3046,Northwestern Dr,419238039
14,44004,Alison Eska,327797,2951,Northwestern Dr,306417867
15,98593,Jonah Toner,578982,2947,Northwestern Dr,745853548
16,59307,Cyril Yongue,753524,2903,Northwestern Dr,866057839
17,34155,Allyson Lazenson,814209,2840,Northwestern Dr,991150469
18,90397,Dionna Kranwinkle,797260,2678,Northwestern Dr,278964807
19,54564,Sammie Sengun,217286,2590,Northwestern Dr,848854310
20,53699,Christian Pagano,628433,2585,Northwestern Dr,644772304
21,34352,Vincenza Burkhardt,436470,2512,Northwestern Dr,197913046
22,80921,Donovan Yackley,222395,2386,Northwestern Dr,515049359
23,96178,Galina Khuu,450248,2183,Northwestern Dr,398518185
24,81885,Kurtis Masuda,934201,2108,Northwestern Dr,201272595
25,88423,Teri Ehrich,510876,1879,Northwestern Dr,248637345
26,51552,Bonita Knie,764124,1726,Northwestern Dr,597137908
27,72076,Courtney Bordeaux,324614,1707,Northwestern Dr,347966356
28,81052,Calvin Czelusniak,471483,1516,Northwestern Dr,657531837
29,71924,Laurie Scronce,774116,1418,Northwestern Dr,254883636
30,23960,Kristopher Lagerberg,658777,1392,Northwestern Dr,492912529
31,70485,Andera Kostelecky,354822,1252,Northwestern Dr,787423012
32,22239,Dusty Sigafus,710517,1125,Northwestern Dr,724386723
33,18376,Josh Shi,653712,1091,Northwestern Dr,193899001
34,29608,Willetta Lurvey,800568,1028,Northwestern Dr,843751378
35,33415,Homer Simpson,108392,981,Northwestern Dr,871392019
36,55130,Shiloh Huntoon,472118,951,Northwestern Dr,826647644
37,44542,Ivory Mcgrevey,873842,897,Northwestern Dr,988557407
38,99826,Ivy Kazarian,994470,892,Northwestern Dr,208359813
39,25615,Olevia Morena,388477,812,Northwestern Dr,962831331
40,40760,Renata Faver,976650,745,Northwestern Dr,547572040
41,10010,Muoi Cary,385336,741,Northwestern Dr,828638512
42,39688,Abe Roeker,537445,689,Northwestern Dr,438969447
43,26758,Angelena Billman,942074,629,Northwestern Dr,341854756
44,75484,Del Tacderen,447887,607,Northwestern Dr,243821337
45,12711,Norman Apolito,667757,599,Northwestern Dr,778264744
46,85280,Donn Duin,569122,540,Northwestern Dr,613873810
47,40336,Fredia Billeter,251082,404,Northwestern Dr,108056488
48,15171,Weldon Penso,336999,311,Northwestern Dr,131379495
49,89906,Kinsey Erickson,510019,309,Northwestern Dr,635287661

In [29]:
# 7. Por lo tanto, el primer testigo es:
testigo1 = df1.head(1)
testigo1

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [30]:
# 8. El segundo testigo se llama Annabel y vive en Franklin Ave, 
# así que la busco en la tabla person
query = '''
SELECT *
FROM person
WHERE name LIKE 'Annabel%' AND address_street_name = 'Franklin Ave'
'''

sql_query(query)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

In [31]:
# 9. Me quedo con la información del testigo 2
testigo2 = sql_query(query)

In [46]:
# 10. Me quedo con las id de los testigos, y los paso a integer porque en el modelo
# poner que en la tabla interview los personId son integer
id1 = testigo1["id"].astype(int)[0]
id2 = testigo2["id"].astype(int)[0]
print(id1, id2)

14887 16371

In [ ]:
# 10. Ahora que tengo a los dos testigos, voy a ver qué dijeron en
# sus entrevistas en la tabla interview. Empiezo con testigo1
query = f'''
SELECT *
FROM interview
WHERE person_id = {id1}
'''

sql_query(query)

   person_id                                         transcript
0      14887  I heard a gunshot and then saw a man run out. ...

In [ ]:
# Como aquí no me muestra todo, lo ejecuto en la web y pone lo siguiente:

# Escuché un disparo y luego vi a un hombre salir corriendo. 
# Tenía una bolsa "Get Fit Now Gym". 
# El número de membresía en la bolsa comenzaba con "48Z". 
# Solo los miembros de oro tienen esas bolsas. 
# El hombre se metió en un coche con una placa que incluía "H42W".

In [50]:
# 11. Sigo con testigo2
query = f'''
SELECT *
FROM interview
WHERE person_id = {id2}
'''

sql_query(query)

   person_id                                         transcript
0      16371  I saw the murder happen, and I recognized the ...

In [ ]:
# Lo ejecuto en la web y pone lo siguiente:
# Vi el asesinato y reconocí al asesino en mi gimnasio 
# cuando estaba haciendo ejercicio la semana pasada, el 9 de enero.

In [ ]:
# 12. Según lo que ha dicho el testigo 1, voy a nuscar a miembros del gym
# que empiecen por 48Z y que sean clientes Gold
query = '''
SELECT *
FROM get_fit_now_member
WHERE id LIKE '48Z%' AND membership_status = 'gold'
'''

sql_query(query)

      id  person_id           name  membership_start_date membership_status
0  48Z7A      28819   Joe Germuska               20160305              gold
1  48Z55      67318  Jeremy Bowers               20160101              gold

In [56]:
# Voy a tirar del hilo del testigo 2
# Buscando quién estuvo en el gym el 9 de enero
query = '''
SELECT *
FROM get_fit_now_check_in
WHERE check_in_date = 20180109 AND membership_id LIKE '48Z%';
'''

sql_query(query)

  membership_id  check_in_date  check_in_time  check_out_time
0         48Z7A       20180109           1600            1730
1         48Z55       20180109           1530            1700

In [53]:
# He obtenido 2, vamos a ver quién de ellos tiene en la matrícula H42W
sospechoso1 = 28819
sospechoso2 = 67318

In [ ]:
# Busco a estos dos sospechosos haciendo JOIN con la tabla de conductores
query = f'''
SELECT *
FROM person
JOIN drivers_license
  ON person.license_id = drivers_license.id
WHERE person.id IN ({sospechoso1}, {sospechoso2});
'''

sql_query(query)

,id,name,license_id,address_number,address_street_name,ssn,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS

In [ ]:
# Con esto ya tendríamos al asesino, Jeremy Bowers, que efectivamente tiene en su matrícula H42W